GROUP_ID = 199292054
TOKEN = '6862e1be89bf14bc86d9f8889c01752fb7d82bbcc0f2eeeb9a4b48b9973e335331b6918e38a669a425b5e'
INTENTS = [
    {
        "name": "Справка",
        "tokens": ("справк", "help"),
        "scenario": None,
        "answer": "Мы можем помочь вам быстро найти необходимый билет.\n Чтобы начать поиск и посмотреть 5 лучших "
                  "вариантов рейсов напишите:\n/start \nи ответте на несколько вопросов." 
                  "Для вызова справки введите:\n/help"
    },
    {
        "name": "Старт поиска ",
        "tokens": ("start", "старт", "найди", "ищи", "нач"),
        "scenario": "searching",
        "answer": None
    }
]
SCENARIOS = {
    "searching": {
        "first_step": "step1",
        "steps": {
            "step1": {
                "text": "Для заказа билета введите город отправления",
                "failure_text": f"Мы не нашли билеты из этого города. Можем предложить такие "
                                f"варианты: ",
                "handler": "handler_from_city",
                "next_step": "step2"
            },
            "step2": {
                "text": "Введите город назначения",
                "failure_text": f"Мы не нашли билеты в этот город. Можем предложить такие "
                                f"варианты: ",
                "handler": "handler_to_city",
                "next_step": "step3"
            },
            "step3": {
                "text": "Введите дату вылета в формате 01-05-2019",
                "failure_text": "Проверьте формат ввода. Правильный формат: 01-05-2019\nДата не должа быть прошедшей",
                "handler": "handler_date",
                "next_step": "step4"
            },
            "step4": {
                "text": "Вот 5 ближайших к указанной дате рейсов с указанием их номеров. "
                        "Введите номер понравившегося рейса",
                "failure_text": "Введите номер понравившегося рейса (цифру)",
                "handler": "handler_choose_flight",
                "next_step": "step5"
            },
            "step5": {
                "text": "Введите необходимое количество мест (от 1 до 5)",
                "failure_text": "введите количество цифрой от 1 до 5",
                "handler": "handler_number_of_passengers",
                "next_step": "step6"
            },
            "step6": {
                "text": "Возможно у вас есть комментарий к заказу? Можете их написать. Если нет - напишите 'Нет' ",
                "failure_text": None,
                "handler": "handler_comments",
                "next_step": "step7"
            },
            "step7": {
                "text": "Давайте уточним введенные данные. Здесь все указано верно?",
                "failure_text": "Чтобы еще раз посмотреть 5 лучших вариантов рейсов' \
               ' введите /start и ответте на несколько вопросов.",
                "handler": "handler_check_data",
                "next_step": "step8"
            },
            "step8": {
                "text": "Последний шаг. Напишите ваш контактный номер телефона в формате +00 000 000 00 00",
                "failure_text": "Проверьте введеные данные, введите в формате: +00 000 000 00 00",
                # "image": "handler_generate_ticket",
                "handler": "handler_check_tell",
                "next_step": "step9"
            },
            "step9": {
                "text": "Вот ваш билет\nЖдите звонок, с вами свяжутся для уточнения вопросов\n"
                        "✈ ✈ ✈ ✈ ✈ ✈ ✈ ✈ ✈ ✈\nПриятного полета",
                "failure_text": None,
                "image": "handler_generate_ticket",
                "handler": None,
                "next_step": None
            }
        }
    }
}
DEFAULT_ANSWER = "Мы можем помочь вам быстро найти необходимый билет. Чтобы начать поиск и посмотреть 5 лучших " \
                 "вариантов рейсов введите:\n/start" \
                 "\nДля вызова справки введите:\n/help\n ✈ ✈ ✈ ✈ ✈ ✈ ✈ ✈ ✈ ✈ "
GREETING = "Привет! " + DEFAULT_ANSWER
FLIGHTS = {
    "fly_from": {"киев": {
        "днепр": {
            "timetable": {
                "data": 'каждый день',
                "time": '09:40, 17:00, 19:30'
            }
        },
        "москва": {
            "timetable": {
                "data": 'по будням',
                "time": '09:00, 22:00'
            }
        },
        "париж": {
            "timetable": {
                "data": 'по будням',
                "time": '12:00, 21:00'
            }
        },
        "тбилиси": {
            "timetable": {
                "data": 'по нечетным',
                "time": '13:00, 22:00'
            }
        },
        "одесса": {
            "timetable": {
                "data": 'каждый день',
                "time": '08:00, 13:00, 22:00'
            }
        }

    },
        "днепр": {
            "киев": {
                "timetable": {
                    "data": 'каждый день',
                    "time": '09:40, 17:00, 19:30'
                }
            },
            "москва": {
                "timetable": {
                    "data": 'по будням',
                    "time": '09:00, 22:00'
                }
            },
            "париж": {
                "timetable": {
                    "data": 'по будням',
                    "time": '12:00, 21:00'
                }
            },
            "тбилиси": {
                "timetable": {
                    "data": 'по нечетным',
                    "time": '13:00, 22:00'
                }
            },
            "одесса": {
                "timetable": {
                    "data": 'каждый день',
                    "time": '08:00, 13:00, 22:00'
                }
            }

        },
        "москва": {
            "киев": {
                "timetable": {
                    "data": 'каждый день',
                    "time": '09:40, 17:00, 19:30'
                }
            },
            "днепр": {
                "timetable": {
                    "data": 'по будням',
                    "time": '09:00, 22:00'
                }
            },
            "париж": {
                "timetable": {
                    "data": 'по нечетным',
                    "time": '12:00, 21:00'
                }
            },
            "тбилиси": {
                "timetable": {
                    "data": 'по будням',
                    "time": '13:00, 22:00'
                }
            },
            "одесса": {
                "timetable": {
                    "data": 'каждый день',
                    "time": '08:00, 13:00, 22:00'
                }
            }

        },
        "париж": {
            "киев": {
                "timetable": {
                    "data": 'каждый день',
                    "time": '09:40, 17:00, 19:30'
                }
            },
            "днепр": {
                "timetable": {
                    "data": 'по будням',
                    "time": '09:00, 22:00'
                }
            },
            "москва": {
                "timetable": {
                    "data": 'по будням',
                    "time": '12:00, 21:00'
                }
            },
            "тбилиси": {
                "timetable": {
                    "data": 'по нечетным',
                    "time": '13:00, 22:00'
                }
            },
            "одесса": {
                "timetable": {
                    "data": 'каждый день',
                    "time": '08:00, 13:00, 22:00'
                }
            }

        },
        "тбилиси": {
            "киев": {
                "timetable": {
                    "data": 'каждый день',
                    "time": '09:40, 17:00, 19:30'
                }
            },
            "днепр": {
                "timetable": {
                    "data": 'по будням',
                    "time": '09:00, 22:00'
                }
            },
            "париж": {
                "timetable": {
                    "data": 'по будням',
                    "time": '12:00, 21:00'
                }
            },
            "москва": {
                "timetable": {
                    "data": 'по нечетным',
                    "time": '13:00, 22:00'
                }
            },
            "одесса": {
                "timetable": {
                    "data": 'каждый день',
                    "time": '08:00, 13:00, 22:00'
                }
            }

        },
        "одесса": {
            "киев": {
                "timetable": {
                    "data": 'каждый день',
                    "time": '09:40, 17:00, 19:30'
                }
            },
            "днепр": {
                "timetable": {
                    "data": 'по будням',
                    "time": '09:00, 22:00'
                }
            },
            "париж": {
                "timetable": {
                    "data": 'по будням',
                    "time": '12:00, 21:00'
                }
            },
            "тбилиси": {
                "timetable": {
                    "data": 'по нечетным',
                    "time": '13:00, 22:00'
                }
            },
            "москва": {
                "timetable": {
                    "data": 'каждый день',
                    "time": '08:00, 13:00, 22:00'
                }
            }

        }
    }
}
DB_CONFIG = dict(
    provider='postgres',
    user='postgres',
    password='212121',
    host='localhost',
    database='avia_bot'
)